<?php

$area_array = [
    'Москвоская область' => ['Москва', 'Зеленоград', 'Клин', 'Электросталь'],
    'Лениградская область' => ['Санкт-Петербург', 'Кронштадт', 'Выборг', 'Сосновый Бор', 'Кириши'],
    'Рязанская область' => ['Рязань'],
    'Нижегородска область' => ['Дзержинск', 'Кстово', 'Павлово'],
    'Тверская олбасть' => ['Тверь', 'Ржев']
];
foreach ($area_array as $key => $value) {
    echo "<br> <b>$key</b> : <br>";
    foreach ($value as $k => $v) {
        echo "$v ";
    }
}        

?>
